/*===================================================
 * Cpp在线参考手册:https://cppreference.cn/
 *===================================================
 * 12.左值与右值.
 * 左值存储在内存中，可以获取地址并在以后使用
 * 右值就是暂时或者临时的值，存储在寄存器中，无法获取地址。&&可以存储右值。
 *==================================================
 */

#include <iostream>
using namespace std ;


int main(int argc, char *argv[])
{
    cout<<"==================== begin ===================="<<endl;

    // 左值
    int a{1};

    cout << &a << endl;

    // 右值
    // 这里的20就是右值
    // 这里的20是在栈里面，所以这里用一个指针来存储b的临时地址
    int && b = 20 ;
    cout << b << endl;

    // cpp中提供move函数，避免深拷贝，使用移动构造，节省系统资源
    int && c = move(a) ;



    cout<<"===================== end ====================="<<endl;
    return 0 ;
}